{
  "backend/main.mo": "Main Motoko actor implementing the backend with video upload/retrieval, user profile management, and follower/unfollow functionality, all gated by access control permissions.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—the Follow button on the profile page and React Query hooks for follow/unfollow—to their respective source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-line summaries of each frontend source file, serving as a quick reference for the frontend codebase structure.",
  "frontend/index.css": "Global CSS entry point importing Tailwind layers and defining OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML shell titled 'Creator Studio' that mounts the React app at the root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for video feed, player, profile, and upload pages, and conditionally renders the ProfileSetupModal for new authenticated users.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component that renders the NavigationBar, a centered main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout and showing appropriate icons and loading state.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with links to Videos and Profile pages, an Upload Video button shown only to authenticated users, and the LoginButton.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and saves it as their profile via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/UploadSuccessModal.tsx": "Confirmation modal displayed after a successful video upload, with a button to navigate to the video feed.",
  "frontend/src/components/VideoCard.tsx": "Card component that displays a video's placeholder thumbnail, title, description, and upload date, navigating to the video player on click.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, exposing identity state and status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including listing/getting videos, user profiles, admin checks, and follow/unfollow operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the creator's profile page with avatar, video count, follower count, and a follow/unfollow button for non-admin viewers, persisting the creator's principal in localStorage.",
  "frontend/src/pages/UploadVideoPage.tsx": "Provides a form for authenticated users to upload videos with title, description, and a file picker that validates video duration between 10–20 seconds before submitting.",
  "frontend/src/pages/VideoFeedPage.tsx": "Renders a responsive grid of video cards fetched from the backend, showing skeletons while loading and an empty state when no videos exist.",
  "frontend/src/pages/VideoPlayerPage.tsx": "React page component that fetches and displays a single video by ID, rendering a native HTML5 video player with title, upload date, and description, plus loading skeletons and a not-found state.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (supporting both standard and hash-based routing), persist them to sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that enables dark mode, registers typography/container-queries/animate plugins, and defines a custom design system with OKLCH color tokens, fonts, border radii, shadows, and keyframe animations.",
  "project_state.json": "Project state manifest tracking the FloridaDave fan app's version, existing features (follow button, React Query hooks), pending feature requests (smooth follow flow, backend follower storage), and architectural notes about ICP hosting with a custom domain."
}