{
  "backend/main.mo": "Main actor for the Creator Studio backend, handling video upload/retrieval, thumbnail upload, user profiles, and follower functionality with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades the actor state by adding a nullable `thumbnail` field to all existing Video records.",
  "feature_evidence.json": "Feature evidence report mapping three thumbnail-related features (upload, VideoCard display, VideoPlayer poster) to their implementing files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file for build planning reference.",
  "frontend/index.css": "Global CSS entry point importing Tailwind and defining OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app at `#root` and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for feed, video player, profile, and upload pages, and conditionally renders the ProfileSetupModal for new users.",
  "frontend/src/components/Layout.tsx": "Wrapper component that renders the NavigationBar, a centered main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and disabled state during authentication.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with links to Videos, Profile, and an Upload Video button shown only to authenticated users, plus the LoginButton.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter a display name and saves it via the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/UploadSuccessModal.tsx": "Confirmation modal displayed after a successful video upload, offering a button to navigate to the video feed.",
  "frontend/src/components/VideoCard.tsx": "A card component that displays a video's thumbnail, title, description, view count, and upload date, and navigates to the video page on click.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including listing/getting videos, user profiles, admin checks, follow/unfollow operations, and video/thumbnail uploads.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ProfilePage.tsx": "A profile page that displays the creator's info, video count, follower count, and allows authenticated non-creator users to follow/unfollow the creator, persisting the creator's principal in localStorage.",
  "frontend/src/pages/UploadVideoPage.tsx": "A video upload page that validates video duration (10–20 seconds), accepts an optional thumbnail, and submits the video and thumbnail to the backend with progress feedback.",
  "frontend/src/pages/VideoFeedPage.tsx": "Displays a responsive grid of video cards fetched via `useListVideos`, showing skeletons while loading and an empty-state message if no videos exist.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Renders a full video player for a single video fetched by ID, including title, upload date, view count, description, and optional thumbnail as the video poster.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, extended typography/container-query/animate plugins, and custom font families and keyframes.",
  "project_state.json": "Tracks project state at version 3, recording existing thumbnail-related features (upload input, VideoCard display, player poster) and pending backend work to add an optional thumbnail blob field and upload endpoint."
}