{
  "backend/main.mo": "Main Motoko actor implementing a video sharing platform with blob storage, access control, video upload/retrieval, user profiles, and a follower system.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—the 'About Florida Dave' bio section and the wave SVG divider—to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for build planning and code navigation.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point for the React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for feed, video player, profile, and upload pages, and conditionally renders the profile setup modal for new authenticated users.",
  "frontend/src/components/AboutSection.tsx": "Renders the 'About Florida Dave' section with a heading, bio paragraph, and WaveDivider components above and below the content.",
  "frontend/src/components/Layout.tsx": "Wraps page content with a sticky navigation bar, centered main container, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and disabled state during authentication.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with app logo, links to Videos and Profile pages, a conditional Upload Video button for authenticated users, and the LoginButton.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog prompting new authenticated users to enter a display name to create their profile, with form validation and save mutation.",
  "frontend/src/components/UploadSuccessModal.tsx": "Confirmation modal displayed after a successful video upload, with a button to navigate back to the video feed.",
  "frontend/src/components/VideoCard.tsx": "A card component that displays a video's thumbnail, title, description, view count, and upload date, and navigates to the video page on click.",
  "frontend/src/components/WaveDivider.tsx": "A purely decorative SVG wave divider component rendered as a full-width horizontal separator.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including listing/fetching videos, user profiles, video uploads, thumbnail uploads, admin checks, and follow/unfollow operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light and dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ProfilePage.tsx": "A profile page that displays the creator's stats (videos, views, followers), persists the creator's principal in localStorage, and allows authenticated non-creator users to follow or unfollow the creator.",
  "frontend/src/pages/UploadVideoPage.tsx": "Page component for uploading videos with title, description, thumbnail, and video file inputs; enforces 10–20 second duration limits, tracks upload progress, and shows a success modal on completion.",
  "frontend/src/pages/VideoFeedPage.tsx": "Page that fetches and displays a grid of video cards with loading skeletons, an empty state, and an AboutSection component below the feed.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Page that loads and plays a single video by ID, displaying its title, upload date, view count, description, and an optional thumbnail poster.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, typography/container-queries/animate plugins, and extended font families, shadows, and keyframes.",
  "project_state.json": "Project state metadata describing the Florida Dave platform, its existing features (About section, wave divider), pending feature requests (video feed with likes/views), and known display issues."
}