{
  "backend/main.mo": "Main Motoko actor implementing a video sharing backend with blob storage, access control, video upload/retrieval, user profiles, and a follower system.",
  "feature_evidence.json": "Feature evidence report mapping the VideoPlayerPage video loading fix to its relevant files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, used as build planning reference.",
  "frontend/index.css": "Root CSS file importing Tailwind layers and defining OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Creator Studio' that mounts the React app into a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for feed, video player, profile, and upload pages, plus conditional ProfileSetupModal for new authenticated users.",
  "frontend/src/components/AboutSection.tsx": "Hero section displaying Florida Dave's avatar, name, location/role tags, and bio paragraph, followed by a WaveDivider.",
  "frontend/src/components/CameoSection.tsx": "Card component advertising Florida Dave's Cameo personalized video messages with four icon-labeled offerings and an external link button.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper rendering the NavigationBar, a centered main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component handling Internet Identity login and logout, clearing React Query cache on logout and showing loading state during authentication.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with the app logo, Videos/Profile links, a conditional Upload Video button for authenticated users, and the LoginButton.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name and saves their profile using the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/UploadSuccessModal.tsx": "A confirmation modal shown after a successful video upload, with a button to navigate to the video feed.",
  "frontend/src/components/VideoCard.tsx": "A card component displaying a video's thumbnail, title, description, upload date, and view count, with click navigation to the video detail page.",
  "frontend/src/components/WaveDivider.tsx": "A purely decorative SVG wave divider component used as a visual separator between sections.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing Internet Identity authentication, including login, logout, and identity persistence via `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including listing/fetching videos, managing user profiles, uploading videos and thumbnails, and checking admin/follower status.",
  "frontend/src/index.css": "Global CSS file that configures Tailwind base/components/utilities and defines light and dark mode CSS custom properties for the design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider`.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the creator's profile page with stats (video count, followers, views), follow/unfollow functionality for non-admin users, and persists the creator's principal in localStorage.",
  "frontend/src/pages/UploadVideoPage.tsx": "Provides a form for authenticated users to upload videos (10–20 seconds) with an optional thumbnail, showing upload progress and a success modal on completion.",
  "frontend/src/pages/VideoFeedPage.tsx": "Renders the main video feed as a responsive grid of VideoCard components, with loading skeletons and an empty-state message, alongside AboutSection and CameoSection.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Displays a single video player page with metadata (title, date, view count), error/loading states, a retry button, and a back-to-feed navigation button.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors via OKLCH variables, fonts, border radii, shadows, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking existing features (video loading fix) and a pending new feature request (AR-2) to correctly display video thumbnails on the VideoFeedPage."
}