{
  "backend/main.mo": "Main Motoko actor for a video-sharing platform implementing video upload, thumbnail management, view counting, user profiles, and follower functionality with role-based access control via mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the Creator Studio SPA, mounting the React app at the root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for feed, video player, profile, and upload pages, and conditionally renders the profile setup modal for newly authenticated users.",
  "frontend/src/components/Layout.tsx": "Wrapper layout component rendering the NavigationBar, a centered main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout and showing loading state during authentication.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with links to Videos and Profile pages, an Upload Video button shown only to authenticated users, and the LoginButton component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and create a profile, using the saveCallerUserProfile mutation with toast feedback.",
  "frontend/src/components/UploadSuccessModal.tsx": "Confirmation modal displayed after a successful video upload, offering a button to navigate to the video feed.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying a video's thumbnail (or placeholder), title, description, upload date, and view count with click navigation to the video player page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider component, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including listing/getting videos, user profiles, admin checks, follow/unfollow operations, and video/thumbnail uploads.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system's color tokens and component variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the creator's profile page with avatar, video count, follower count, and a follow/unfollow button for non-admin viewers, persisting the creator's principal in localStorage.",
  "frontend/src/pages/UploadVideoPage.tsx": "Provides a form for authenticated users to upload videos (enforcing 10–20 second duration) with optional thumbnail selection, progress tracking, and a success modal on completion.",
  "frontend/src/pages/VideoFeedPage.tsx": "Renders a responsive grid of video cards fetched from the backend, showing skeletons while loading and an empty state when no videos exist.",
  "frontend/src/pages/VideoPlayerPage.tsx": "React page component that fetches and displays a single video by ID, showing the video player with optional thumbnail poster, title, upload date, view count, and description, with a back-to-feed button.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routing, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color tokens, typography/container-queries/animate plugins, and extended theme values for fonts, shadows, border radii, and keyframes.",
  "project_state.json": "Project state manifest tracking pending feature requests (AR-1 through AR-5) for adding optional video thumbnail upload support across the frontend upload page, backend actor, VideoCard component, and VideoPlayerPage."
}