{
  "backend/main.mo": "Main Motoko actor for the Creator Studio backend, handling video uploads, thumbnail management, user profiles, and follower relationships with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the AboutSection component was moved to the top of VideoFeedPage above the video grid, with high confidence based on changes to VideoFeedPage.tsx.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference for the build plan.",
  "frontend/index.css": "Global CSS entry point importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, and chart colors.",
  "frontend/index.html": "HTML entry point for the React app titled 'Creator Studio', mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for feed, video player, profile, and upload pages, and conditionally renders the ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/AboutSection.tsx": "Biographical section component for 'Florida Dave' displaying a heading, descriptive paragraph, and WaveDivider separators above and below the content.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper that renders the NavigationBar, a centered main content area, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login and logout, clearing the React Query cache on logout and showing appropriate icons and loading state.",
  "frontend/src/components/NavigationBar.tsx": "Sticky top navigation bar with links to Videos and Profile pages, an Upload Video button shown only to authenticated users, and the LoginButton component.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time profile creation that prompts authenticated users to enter their name and saves it via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/UploadSuccessModal.tsx": "Success confirmation modal displayed after a video upload, with a checkmark icon and a button to navigate to the video feed.",
  "frontend/src/components/VideoCard.tsx": "A card component that displays a video's thumbnail, title, description, view count, and upload date, and navigates to the video page on click.",
  "frontend/src/components/WaveDivider.tsx": "A purely decorative SVG wave divider component rendered as a full-width horizontal separator.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Computer authentication via AuthClient, exposing identity, login, clear, and status state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including listing/fetching videos, user profiles, admin status, video uploads, thumbnails, and follow/unfollow operations.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light and dark mode CSS custom properties for the design system's color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ProfilePage.tsx": "A profile page that displays the creator's stats (videos, views, followers), persists the creator's principal in localStorage, and allows authenticated non-creator users to follow or unfollow the creator.",
  "frontend/src/pages/UploadVideoPage.tsx": "Page component for uploading videos with title, description, thumbnail, and video file inputs; enforces 10–20 second duration limits and shows upload progress with a success modal on completion.",
  "frontend/src/pages/VideoFeedPage.tsx": "Page component that fetches and displays a grid of video cards with loading skeletons and an empty state, preceded by an AboutSection at the top.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Page component that loads and plays a single video by ID, displaying its title, upload date, view count, description, and an optional thumbnail poster.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and removing sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, border radii, box shadows, and animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Project state metadata for 'Florida Dave' tracking schema version, existing features, and a pending feature request to add an About section at the top of the page."
}