{
  "kind": "build_request",
  "title": "Add thumbnail support for videos",
  "projectName": "Creator Studio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend video record to include an optional thumbnail blob field, and add an endpoint to upload/update a video's thumbnail (accepting image blob data) and retrieve it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can I do thumbnails?"
        ]
      },
      "acceptanceCriteria": [
        "The video record type includes an optional thumbnail field (blob or null).",
        "An authenticated video owner can upload or replace a thumbnail for their video.",
        "The thumbnail blob is retrievable by video ID.",
        "Non-owners cannot update another user's thumbnail."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Upload Video page, add an optional thumbnail image upload input that accepts common image formats (JPEG, PNG, WebP). The selected image should be previewed before submission and uploaded alongside the video.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can I do thumbnails?"
        ]
      },
      "acceptanceCriteria": [
        "An image file picker labeled 'Thumbnail (optional)' appears on the upload form.",
        "Only image file types (JPEG, PNG, WebP) are accepted.",
        "A preview of the selected thumbnail is displayed before submission.",
        "The thumbnail is included in the upload submission when provided.",
        "Submitting without a thumbnail still works."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Display the video thumbnail image in the VideoCard component. If no thumbnail has been set, show a neutral placeholder graphic instead.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can I do thumbnails?"
        ]
      },
      "acceptanceCriteria": [
        "VideoCard displays the video's thumbnail image when one exists.",
        "A styled placeholder is shown when no thumbnail is available.",
        "Thumbnail image renders at a consistent aspect ratio across all cards."
      ]
    },
    {
      "id": "REQ-4",
      "text": "On the Video Player page, display the thumbnail as the poster/preview image shown before the video begins playing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "can I do thumbnails?"
        ]
      },
      "acceptanceCriteria": [
        "The video element uses the video's thumbnail as its poster attribute when available.",
        "If no thumbnail exists, no poster is set (default browser behavior)."
      ]
    }
  ],
  "constraints": [
    "Thumbnail data must be stored in the backend canister blob storage, not as external URLs.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Auto-generating thumbnails from video frames.",
    "Thumbnail cropping or editing tools.",
    "Thumbnail management as a separate dedicated page."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}