{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add thumbnail support for videos",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add optional thumbnail image upload input to the Upload Video page with preview functionality",
      "acceptanceCriteria": [
        "An image file picker labeled 'Thumbnail (optional)' appears on the upload form.",
        "Only image file types (JPEG, PNG, WebP) are accepted.",
        "A preview of the selected thumbnail is displayed before submission.",
        "The thumbnail is included in the upload submission when provided.",
        "Submitting without a thumbnail still works."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadVideoPage.tsx",
          "operation": "modify",
          "description": "Add an optional image file input with accept attribute for JPEG, PNG, and WebP formats. Add state management for the selected thumbnail file and preview URL using useState. Display a thumbnail preview section when an image is selected. When submitting the form, convert the selected image file to ExternalBlob using ExternalBlob.fromBytes() and pass it to the uploadVideo mutation. Ensure the form still submits successfully when no thumbnail is selected."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display video thumbnail in VideoCard component with fallback placeholder",
      "acceptanceCriteria": [
        "VideoCard displays the video's thumbnail image when one exists.",
        "A styled placeholder is shown when no thumbnail is available.",
        "Thumbnail image renders at a consistent aspect ratio across all cards."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Modify the VideoCard component to display the video's thumbnail if available using thumbnail.getDirectURL(). When no thumbnail exists, display the generated placeholder image from frontend/public/assets/generated/video-placeholder.dim_400x600.png. Ensure the image renders with consistent aspect ratio using Tailwind's aspect-ratio utilities and object-cover for proper scaling."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Display thumbnail as video poster image on the Video Player page",
      "acceptanceCriteria": [
        "The video element uses the video's thumbnail as its poster attribute when available.",
        "If no thumbnail exists, no poster is set (default browser behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoPlayerPage.tsx",
          "operation": "modify",
          "description": "Update the video element to include a poster attribute set to video.thumbnail.getDirectURL() when video.thumbnail exists. When no thumbnail is available, omit the poster attribute to use default browser behavior. Ensure the poster displays correctly before playback begins."
        }
      ]
    }
  ]
}