{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable video thumbnail uploads",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add optional thumbnail file input to the Upload Video page, with preview and submission alongside video blob",
      "acceptanceCriteria": [
        "The upload form includes a clearly labelled optional thumbnail file input accepting common image formats (PNG, JPG, GIF, WebP).",
        "A preview of the selected thumbnail image is shown before submission.",
        "On form submission, the thumbnail blob is passed to the upload mutation alongside the video.",
        "If no thumbnail is selected, the upload proceeds without one (thumbnail remains optional)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UploadVideoPage.tsx",
          "operation": "modify",
          "description": "Add a file input for optional thumbnail selection (accepting PNG, JPG, GIF, WebP). Add state to store the selected thumbnail file and display a preview image when a file is selected. Modify the form submission handler to convert the thumbnail file to ExternalBlob using ExternalBlob.fromBytes() and pass it as the thumbnail argument to the uploadVideo mutation. Ensure that if no thumbnail is selected, null is passed instead. Verify the blob-storage component's usage instructions before implementing the ExternalBlob conversion."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display uploaded thumbnail in VideoCard component with fallback to placeholder when unavailable",
      "acceptanceCriteria": [
        "VideoCard renders the thumbnail image when a thumbnail blob is present on the video record.",
        "VideoCard renders a sensible fallback (placeholder or gradient) when no thumbnail is available.",
        "Thumbnail images are displayed at consistent, appropriate dimensions within the card layout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Check if the video has a thumbnail field. If present, use thumbnail.getDirectURL() to obtain the thumbnail URL and display it as the card image. If no thumbnail exists, fall back to the existing placeholder image at frontend/public/assets/generated/video-placeholder.dim_400x600.png. Ensure consistent thumbnail dimensions within the card layout. Verify the blob-storage component's usage instructions before implementing the getDirectURL() call."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Use uploaded thumbnail as video poster image in VideoPlayerPage",
      "acceptanceCriteria": [
        "The video element's poster attribute is set to the thumbnail data URL when a thumbnail blob is present.",
        "When no thumbnail is available, the video element has no poster or uses the existing fallback behaviour."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideoPlayerPage.tsx",
          "operation": "modify",
          "description": "Check if the fetched video has a thumbnail field. If present, call thumbnail.getDirectURL() to obtain the thumbnail URL and set it as the poster attribute on the video element. If no thumbnail exists, omit the poster attribute or retain the current default behaviour. Verify the blob-storage component's usage instructions before implementing the getDirectURL() call."
        }
      ]
    }
  ]
}