{
  "backend/main.mo": "Main backend actor implementing video management (upload, list, get) and user profile operations with role-based access control using Internet Identity authentication.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: owner authentication, TikTok-style profile page, video feed interface, and cohesive visual theme with vibrant colors.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, pages, hooks, and styling configurations.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables defining OKLCH color system for light and dark themes using warm orange/red tones.",
  "frontend/index.html": "HTML entry point with root div and module script reference for the React application titled 'Creator Studio'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for video feed, player, profile, and upload pages, plus profile setup modal logic.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing navigation bar, main content container, and footer with caffeine.ai attribution link.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/NavigationBar.tsx": "Sticky navigation header with logo, links to Videos/Profile/Upload pages (admin-only), and login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation with name input form and validation.",
  "frontend/src/components/UploadSuccessModal.tsx": "Success confirmation modal displayed after video upload with navigation to video feed.",
  "frontend/src/components/VideoCard.tsx": "Reusable video card component displaying thumbnail, title, description, and date with hover effects and click navigation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, user roles, and video data through the backend actor, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like buttons, cards, sidebars, and charts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile information including avatar, name, video count, and fan count with loading skeletons during data fetch.",
  "frontend/src/pages/UploadVideoPage.tsx": "Admin-only page for uploading videos with title, description, and file input, showing upload progress and success modal, with access control checks.",
  "frontend/src/pages/VideoFeedPage.tsx": "Displays a grid of video cards from the backend, showing loading skeletons or an empty state when no videos exist.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page that fetches and displays a single video by ID with metadata (title, description, upload date) and a back navigation button.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including color schemes using OKLCH color space, typography with Inter and Poppins fonts, custom animations, and design tokens for a modern UI component system.",
  "project_state.json": "Project state file for Creator Studio, a video-sharing app with owner-only upload access, tracking existing features (authentication, TikTok-style profile, video feed) and pending feature requests for video upload functionality and user authentication."
}